
/************************************************************************************************************/
/*                                                                                                          */
/*      <フローチャート>                                                                                    */
/*                                                                                                          */
/*  |-----------------------|                                                                               */
/*  |                       |                                                                               */
/*  | メイン関数から呼ばれる|                                                                               */
/*  |                       |                                                                               */
/*  |-----------------------|                                                                               */
/*              |                                                                                           */
/*              |                                                                                           */
/*              |                                                                                           */
/*  |-----------------------|                                                                               */
/*  |                       |                                                                               */
/*  |  左右の側面距離を測定 |----------------------------------------------------                           */
/*  |                       |                                                   |                           */
/*  |-----------------------|                               |---------------------------------------|       */
/*              |                                           |           SPIセットアップ             |       */
/*              |                                           |---------------------------------------|       */
/*              |                                                               |                           */
/*  |-----------------------|                               |---------------------------------------|       */
/*  |                       |                               |   赤外線センサでアナログ値を読み込む  |       */
/*  |       <if文>          |       YES                     |---------------------------------------|       */
/*  |                       |----------------                                   |                           */
/*  |左側面距離 > 右側面距離|               |               |---------------------------------------|       */
/*  |                       |               |               |ADコンバータでアナログ値を電圧(V)に変換|       */
/*  |-----------------------|               |               |---------------------------------------|       */
/*              |                           |                                   |                           */
/*              |   NO                      |               |---------------------------------------|       */
/*              |                           |               | 電圧(V)から障害物までの距離(cm)を計算 |       */
/*  |-----------------------|   |-----------------------|   |---------------------------------------|       */
/*  |                       |   |                       |                       |                           */
/*  |       return 右       |   |       return 左       |   |---------------------------------------|       */
/*  |                       |   |                       |   |           return 側面距離             |       */
/*  |-----------------------|   |-----------------------|   |---------------------------------------|       */
/*                                                                                                          */
/************************************************************************************************************/


#include "main.h"
#include "debug.h"


int     sideDistance(void);
float   getSideDistance(int);
void    spiSetup(int);
int     myAnalogRead(int, int);
float   changeAnalogToVolt(int);
float   changeVoltToDistance(float);
float   getDistance(int, int, float, float, float);

#if (DEBUG_SIDE_DISTANCE == MANUAL_V) || (DEBUG_SIDE_DISTANCE == MANUAL_D)
float   manualInput(void);
#endif

static int myFd;


/*|=================================================================================|*/
/*|                                                                                 |*/
/*| 側面距離測定()                                                                  |*/
/*| int sideDistance(void)                                                          |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| メイン関数から呼ばれ、左右の側面距離を比較して距離が長い側をメイン関数に返す。  |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 戻り値 : LEFT(左) or RIGHT(右)         LEFT = 1, RIGHT = 2 のマクロ定数         |*/
/*|                                                                                 |*/
/*|=================================================================================|*/

int sideDistance(void){
    float leftDistance = 0;                                 /*左側面距離*/
    float rightDistance = 0;                                /*右側面距離*/

    leftDistance  = getSideDistance(LEFT);                  /*側面距離測定(左)*/
    rightDistance = getSideDistance(RIGHT);                 /*側面距離測定(右)*/

    if(leftDistance > rightDistance){
        close(myFd);
        return LEFT;
    }else{
        close(myFd);
        return RIGHT;
    }
}


/*|=================================================================================|*/
/*|                                                                                 |*/
/*| 赤外線式側面距離測定(アナログチャネル)                                          |*/
/*| float getSideDistance(int analogChannel)                                        |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 指定したアナログチャネルで計測されたアナログ値から側面距離を計算して返す。      |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 戻り値 : float sideDistance(側面距離)                                           |*/
/*|                                                                                 |*/
/*|=================================================================================|*/

float getSideDistance(int analogChannel){
    int spiChannel = 0;                                     /*SPIチャネル*/
    int analogValue = 0;                                    /*アナログ値*/
    float volt = 0;                                         /*計測電圧*/
    float sideDistance = 0;                                 /*側面距離*/

    spiSetup(spiChannel);                                   /*SPIセットアップ*/
    analogValue = myAnalogRead(spiChannel, analogChannel);  /*アナログ値読み込み*/
    volt = changeAnalogToVolt(analogValue);                 /*アナログ値to計測電圧*/
    sideDistance = changeVoltToDistance(volt);              /*計測電圧to距離*/

    /*DEBUG*/
#if DEBUG_SIDE_DISTANCE != OFF
    if(analogChannel==LEFT){
        printf("LEFT  = ");
    }else{
        printf("RIGHT = ");
    }
    printf("%d\n", analogValue);

    if(sideDistance==-1){
        printf("out of range.(%3fV)\n", volt);
    }else{
        printf("%3fcm(%3fV)\n", sideDistance, volt);
    }
#endif

    return sideDistance;
}


/*|=================================================================================|*/
/*|                                                                                 |*/
/*| SPIセットアップ(SPIチャネル)                                                    |*/
/*| void spiSetup(int spiChannel)                                                   |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 指定されたチャネルにSPIをセットアップし、問題があれば異常終了する。             |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 戻り値 : なし                                                                   |*/
/*|                                                                                 |*/
/*|=================================================================================|*/

void spiSetup(int spiChannel){
    if((myFd = wiringPiSPISetup(spiChannel, 1000000)) < 0){
        fprintf(stderr, "SPIバスをセットアップできませんでした : %s\n", strerror(errno));
        exit(EXIT_FAILURE);
    }else{
        /*DO NOTHING*/
    }
}


/*|=================================================================================|*/
/*|                                                                                 |*/
/*| アナログ値読み込み(SPIチャネル, アナログチャネル)                               |*/
/*| int myAnalogRead(int spiChannel, int analogChannel)                             |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 指定したアナログチャネルからの入力値を10bit分取り出して返す。                   |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 戻り値 : int analogValue(アナログ値)                                            |*/
/*|                                                                                 |*/
/*|=================================================================================|*/

int myAnalogRead(int spiChannel, int analogChannel){
    unsigned char buffer[BUFFER_SIZE] = {1};                /*データ*//*start bit*/
    int analogValue = 0;                                    /*アナログ値*/

    buffer[1] = (analogChannel + CHAN_CONFIG_SINGLE) << 4;
    wiringPiSPIDataRW(spiChannel, buffer, BUFFER_SIZE);
    analogValue = ((buffer[1] & 0b11) << 8) + buffer[2];

    return analogValue;
}


/*|=================================================================================|*/
/*|                                                                                 |*/
/*| アナログ値to電圧(アナログ値)                                                    |*/
/*| float changeAnalogToVolt(int analogValue)                                       |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| アナログ値を電圧(V)に変換する。                                                 |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 戻り値 : float volt(計測電圧)                                                   |*/
/*|                                                                                 |*/
/*|=================================================================================|*/

float changeAnalogToVolt(int analogValue){
    float volt = 0;                                         /*計測電圧*/

    volt = analogValue / CALC10BIT;
    volt = round(volt * 10000000) / 10000000;
    volt *= VREF;

#if DEBUG_SIDE_DISTANCE == MANUAL_V
    volt = manualInput();
#endif

return volt;
}


/*|=================================================================================|*/
/*|                                                                                 |*/
/*| 電圧to距離(計測電圧)                                                            |*/
/*| float changeVoltToDistance(float volt)                                          |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 電圧(V)を距離(cm)に変換する。測定可能範囲外の場合は-1を返す。                   |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 戻り値 : float distance(距離)                                                   |*/
/*|                                                                                 |*/
/*|=================================================================================|*/

float changeVoltToDistance(float volt){
    float distance = 0;                                     /*距離*/
    int D[6]    = {7, 10, 15, 20, 30, 65};                  /*距離配列*/
    float V[6]  = {3.0, 2.3, 1.6, 1.3, 0.9, 0.5};           /*電圧配列*/

    if((V[5] > volt) || (volt > V[0])){                     /*測定可能範囲外*/
        distance = -1;

    }else if((V[0] >= volt) && (volt > V[1])){
        distance = getDistance(D[0], D[1], V[0], V[1], volt);

    }else if((V[1] >= volt) && (volt > V[2])){
        distance = getDistance(D[1], D[2], V[1], V[2], volt);

    }else if((V[2] >= volt) && (volt > V[3])){
        distance = getDistance(D[2], D[3], V[2], V[3], volt);

    }else if((V[3] >= volt) && (volt > V[4])){
        distance = getDistance(D[3], D[4], V[3], V[4], volt);

    }else if((V[4] >= volt) && (volt > V[5])){
        distance = getDistance(D[4], D[5], V[4], V[5], volt);
    }

#if DEBUG_SIDE_DISTANCE == MANUAL_D
    distance = manualInput();
#endif

    return distance;
}


/*|=================================================================================|*/
/*|                                                                                 |*/
/*| 距離測定(距離1, 距離2, 電圧1, 電圧2, 計測電圧)                                  |*/
/*| float getDistance(int D1, int D2, float V1, float V2, float volt)               |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 障害物までの距離(cm)を測定する。                                                |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 戻り値 : float distance(距離)                                                   |*/
/*|                                                                                 |*/
/*|=================================================================================|*/

float getDistance(int D1, int D2, float V1, float V2, float volt){
    float distance = 0;                                     /*距離*/
    float Dcalc = 0;                                        /*計測距離差*/

    int Ddiff   = D2 - D1;                                  /*距離差*/
    float Vdiff = V1 - V2;                                  /*電圧差*/
    float Vcalc = (V1 - volt) * 100;                        /*計測電圧差*/
    float CmPer0_01V = (Ddiff / Vdiff) / 100;               /*cm/0.01V*/

    Dcalc = Vcalc * CmPer0_01V;
    distance = D1 + Dcalc;

    return distance;
}


/*|=================================================================================|*/
/*|                                                                                 |*/
/*| デバッグ値手入力(void)                                                          |*/
/*| float manualInput(void)                                                         |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 電圧(V)や側面距離(cm)の値を手入力する。                                         |*/
/*|                                                                                 |*/
/*|---------------------------------------------------------------------------------|*/
/*|                                                                                 |*/
/*| 戻り値 : float voltInput(手入力電圧)                                            |*/
/*|                                                                                 |*/
/*|=================================================================================|*/

#if (DEBUG_SIDE_DISTANCE == MANUAL_V) || (DEBUG_SIDE_DISTANCE == MANUAL_D)
float manualInput(void){
    float inputValue = 0;                                   /*手入力値*/

    printf("Input Value : ");
    scanf("%f", &inputValue);
    return inputValue;
}
#endif
